app/views/entries/index.html.erb

		<p><%= entry.description.html_safe %></p>
		<p class="tags"><%= raw @entry.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></p>
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'buildings insurance')