app/controllers/entries_controller.rb

  def index
    if params[:tag]
      @entries = Entry.tagged_with(params[:tag])
    else
      @entries = Entry.search(params[:search])
---
SELECT "entries".* FROM "entries" JOIN taggings entries_taggings_b3d5c49 ON entries_taggings_b3d5c49.taggable_id = entries.id AND entries_taggings_b3d5c49.taggable_type = 'Entry' AND entries_taggings_b3d5c49.tag_id = 2 ORDER BY landlord_id, guide_id
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'buildings insurance')

  def create
    @entry = Entry.new(params[:entry])
    if @entry.save
---
INSERT INTO "entries" ("created_at", "description", "guide_id", "home_id", "landlord_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE (landlord_id < 2) ORDER BY landlord_id desc LIMIT 1

  def edit
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @entry = Entry.find(params[:id])
    if @entry.update_attributes(params[:entry])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "entries" SET "description" = 'Take the scenario where your tenant is seriously injured because of a defect in the building or contents, it is most likely that the tenant would hold you responsible for their injuries and possibly want to sue you for damages. Landlord liability protects the landlord in the case, and without it you could face substantial losses.', "landlord_id" = 2, "updated_at" = '2013-09-13 14:03:50.569259' WHERE "entries"."id" = 8

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]